20240704T211631--kdoc-196-気乗りしない仕事に意味を見出す__essay.org
:properties:
:ID: 20240704T211631
:mtime:    20241102180331 20241028101410
:ctime:    20241028101410
:end:
#+title:      KDOC 196: 気乗りしない仕事に意味を見出す
#+date:       [2024-07-04 Thu 21:16]
#+filetags:   :essay:
#+identifier: 20240704T211631

* この文書のステータス
- 作成
  - [X] 2024-07-04 貴島
- レビュー
  - [X] 2024-07-18 貴島

* 概要
仕事の中には、気乗りしないものもある。よく知らない時代遅れの技術(とみなしている)の仕事に取り組まないといけないことはたまにある。

同僚のとてつもなく仕事のデキる人は、そういう仕事も涼しい顔で完璧にこなす。そういう種類の仕事にどうあたっているかを観察した。自分と異なる部分があり、その積み重ねが優れた仕事をする要素の1つとなっているように見えた。

異なるのは、問題へ取り組む前に周辺領域を調べていることだ。すぐ解決しようと適当にググって飛びつくのではなく、よく背景を理解してから問題へ取り組んでいるように見える。彼は「技術Xはクソだ」、と言わない。背景を理解したうえで、意外と悪くない、ということが多い。

嫌な仕事を早く終わらそうとして、表面だけなぞってこなすのは、仕事や人生を楽しくなくする。向き合えばそれなりに学べることがある。焦ってはいけない。

* 関連
- [[id:20221205T020840][KDOC 9: 上には上のオタクがいる]]。観察したつながり
