20240704T211631--kdoc-196-気乗りしない仕事に意味を見出す__essay.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-27T23:15:49Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 196: 気乗りしない仕事に意味を見出す</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 196: 気乗りしない仕事に意味を見出す</h1>
<div id="outline-container-org4811cbe" class="outline-2">
<h2 id="org4811cbe"><a href="#org4811cbe">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org4811cbe">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-07-04 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-07-18 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org69fbfe3" class="outline-2">
<h2 id="org69fbfe3"><a href="#org69fbfe3">概要</a></h2>
<div class="outline-text-2" id="text-org69fbfe3">
<p>
仕事の中には、気乗りしないものもある。よく知らない時代遅れの技術(とみなしている)の仕事に取り組まないといけないことはたまにある。
</p>

<p>
同僚のとてつもなく仕事のデキる人は、そういう仕事も涼しい顔で完璧にこなす。そういう種類の仕事にどうあたっているかを観察した。自分と異なる部分があり、その積み重ねが優れた仕事をする要素の1つとなっているように見えた。
</p>

<p>
異なるのは、問題へ取り組む前に周辺領域を調べていることだ。すぐ解決しようと適当にググって飛びつくのではなく、よく背景を理解してから問題へ取り組んでいるように見える。彼は「技術Xはクソだ」、と言わない。背景を理解したうえで、意外と悪くない、ということが多い。
</p>

<p>
嫌な仕事を早く終わらそうとして、表面だけなぞってこなすのは、仕事や人生を楽しくなくする。向き合えばそれなりに学べることがある。焦ってはいけない。
</p>
</div>
</div>
<div id="outline-container-org97e30ff" class="outline-2">
<h2 id="org97e30ff"><a href="#org97e30ff">関連</a></h2>
<div class="outline-text-2" id="text-org97e30ff">
<ul class="org-ul">
<li><a href="20221205T020840--kdoc-9-上には上のオタクがいる__essay.html#ID-20221205T020840">KDOC 9: 上には上のオタクがいる</a>。観察したつながり</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
